Vulintus/Vulintus_Board_Definitions/hardware/samd/0.2.0/variants/omnitrak_controller_v2_2/variant.h
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_OMNITRAK_CONTROLLER_V2_2_
#define _VARIANT_OMNITRAK_CONTROLLER_V2_2_

// The definitions here need a SAMD core >=1.6.10
#define ARDUINO_SAMD_VARIANT_COMPLIANCE 10610

// Non-pin definitions specific to this circuit board iteration.
#define CIRCUIT_BOARD_VER       22              // Divide by 10 to match the Eagle design version.
#define NUM_OTMP_PORTS          5               // Number of OTMP ports.
#define OMNITRAK_NUM_CUE_LED		1               // Number of cue/indicator LEDs.
#define OMNITRAK_NUM_TTL_IO		  2               // Number of TTL I/O connections.
#define VULINTUS_DEVICE_MAX_BAUDRATE  1000000   // Maximum serial baud rate.


// RTC nonvolatile memory address assignments (43 bytes total).
#define NVM_ADDR_VULINTUS_ALIAS		0     // Starting address for the Vulintus-set alias (30 bytes).

// I2C Addresses.
#define I2C_ADDR_AT42QT2120   0x1C        // AT42QT2120 QTouch controller.
#define I2C_ADDR_MCP40D17     0x2E        // MCP40D17 digital potentiometer (for volume control).
#define I2C_ADDR_EEPROM       0x50        // AT24C02D I2C EEPROM (256 bytes).
#define I2C_ADDR_RV3028C7     0x52        // RV-3028-C7 real-time clock.
#define I2C_ADDR_ATECC608     0x60        // ATECC608x cryptographic co-processor.
#define I2C_ADDR_BME680       0x76        // BME680 temperature/pressure/humidity/gas sensor.


/*----------------------------------------------------------------------------
 *        Definitions
 *----------------------------------------------------------------------------*/

/** Frequency of the board main oscillator */
#define VARIANT_MAINOSC		(32768ul)

/** Master clock frequency */
#define VARIANT_MCK        (F_CPU)

#define VARIANT_GCLK0_FREQ (F_CPU)
#define VARIANT_GCLK1_FREQ (48000000UL)
#define VARIANT_GCLK2_FREQ (100000000UL)

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
extern "C" unsigned int PINCOUNT_fn();
#endif // __cplusplus

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
#define PINS_COUNT           (PINCOUNT_fn())
#define NUM_DIGITAL_PINS     (96u)
#define NUM_ANALOG_INPUTS    (15u)
#define NUM_ANALOG_OUTPUTS   (2u)
#define analogInputToDigitalPin(p) ((p < 5) ? 45 + (p) : (p < 10) ? 69 + (p) : (p < 14) ? 84 + (p) : (p == 14) ? 93 : (p == 15) ? 99 : -1)

/* 
  if (p < 5) {                          (p < 5) ?
    45 + (p);                           45 + (p)
  }             
  else if (p < 10) {                    : (p < 10) ?
    69 + (p) - 5;                       69 + (p)
  }
  else if (p < 14) {                    : (p < 14) ?
    84 + (p) - 10;                      84 + (p)
  }
  else if (p == 14) {                   : (p == 14) ?
    93;                                 93
  }
  else if (p == 15) {                   : (p == 15) ?
    99;                                 99
  }
  else {
    -1;                                 : -1
  }
*/

#define digitalPinToPort(P)        ( &(PORT->Group[g_APinDescription[P].ulPort]) )
#define digitalPinToBitMask(P)     ( 1 << g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   ( &(port->OUT.reg) )
#define portInputRegister(port)    ( &(port->IN.reg) )
#define portModeRegister(port)     ( &(port->DIR.reg) )
#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

/*
 * digitalPinToTimer(..) is AVR-specific and is not defined for SAMD
 * architecture. If you need to check if a pin supports PWM you must
 * use digitalPinHasPWM(..).
 *
 * https://github.com/arduino/Arduino/issues/1833
 */
// #define digitalPinToTimer(P)


/*
 * Status LEDs
 */
#define PIN_LED_R           (32u)         //PA18 - Red channel of the RGB LED.
#define PIN_LED_G           (33u)         //PA17 - Green channel of the RGB LED.
#define PIN_LED_B           (34u)         //PA16 - Blue channel of the RGB LED.
#define PIN_LED_DEMUX_A     (40u)         //PB15 - Demultiplexer input for encoder LED indication.
#define PIN_LED_DEMUX_B     (41u)         //PB18 - Demultiplexer input for encoder LED indication.
#define PIN_LED_DEMUX_C     (42u)         //PD10 - Demultiplexer input for encoder LED indication.
#define PIN_LED_DEMUX_D     (43u)         //PD09 - Demultiplexer input for encoder LED indication.
#define LED_R               PIN_LED_R
#define LED_G               PIN_LED_G
#define LED_B               PIN_LED_B
#define LED_BUILTIN         PIN_LED_G


/*
 * Analog pins
 */
#define PIN_A0              (45ul)        //PC30 - V_IN_ADC   (45)
#define PIN_A1              (PIN_A0 + 1)  //PD00 - I_IN_ADC   (46)
#define PIN_A2              (PIN_A0 + 2)  //PB05 - 9V_UVLO    (47)
#define PIN_A3              (PIN_A0 + 3)  //PB04 - 9V_ADC     (48)
#define PIN_A4              (PIN_A0 + 4)  //PB06 - 5V_ADC     (49)
#define PIN_A5              (69ul)        //PD01 - P1_IOUT    (69)
#define PIN_A6              (PIN_A5 + 1)  //PC31 - P2_IOUT    (70)
#define PIN_A7              (PIN_A5 + 2)  //PC00 - P3_IOUT    (71)
#define PIN_A8              (PIN_A5 + 3)  //PC01 - P4_IOUT    (72)
#define PIN_A9              (PIN_A5 + 4)  //PC02 - P5_IOUT    (73)
#define PIN_A10             (84ul)        //PA02 - BNC_OUT_1  (84)
#define PIN_A11             (PIN_A10 + 1) //PA05 - BNC_OUT_2  (85)
#define PIN_A12             (PIN_A10 + 2) //PB09 - BNC_IN_1   (86)
#define PIN_A13             (PIN_A10 + 3) //PB08 - BNC_IN_2   (87)
#define PIN_A14             (93ul)        //PB07 - BOARD_ID   (93)
#define PIN_A15             (99ul)        //PA03 - VREF       (93)

#define PIN_DAC0            PIN_A10
#define PIN_DAC1            PIN_A11

static const uint8_t A0   = PIN_A0;
static const uint8_t A1   = PIN_A1;
static const uint8_t A2   = PIN_A2;
static const uint8_t A3   = PIN_A3;
static const uint8_t A4   = PIN_A4;
static const uint8_t A5   = PIN_A5;
static const uint8_t A6   = PIN_A6;
static const uint8_t A7   = PIN_A7;
static const uint8_t A8   = PIN_A8;
static const uint8_t A9   = PIN_A9;
static const uint8_t A10  = PIN_A10;
static const uint8_t A11  = PIN_A11;
static const uint8_t A12  = PIN_A12;
static const uint8_t A13  = PIN_A13;
static const uint8_t A14  = PIN_A14;
static const uint8_t A15  = PIN_A15;

static const uint8_t DAC0 = PIN_DAC0;
static const uint8_t DAC1 = PIN_DAC1;

#define ADC_RESOLUTION		  12

